app/controllers/schools_controller.rb

  def show
    @college = School.find(params[:id])
---
SELECT "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", "1"]]

  def index
  	if params[:search]
  		@colleges = School.where('schools.name LIKE ?',"%#{params[:search]}%").paginate(page: params[:page])
  	else
  		@colleges = School.paginate(page: params[:page])
---
SELECT "schools".* FROM "schools" WHERE (schools.name LIKE '%American Institute%') LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "schools" WHERE (schools.name LIKE '%American Institute%')
SELECT "schools".* FROM "schools" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "schools"