app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
  	if params[:search]
  		@users = User.where('users.name LIKE ?',"%#{params[:search]}%").paginate(page: params[:page])
  	else
  		@users = User.paginate(page: params[:page])

UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$PjFKgOsS9sSYjOx.yw1H2euMx2n89CTSer1N9adHgf3khZvlwUnV2', "remember_token" = 'Us36LYBz8pSQwxlrRFNjYA', "updated_at" = '2012-06-04 07:07:31.963964' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])